import { ReadingArticle } from './types';

export const READING_ARTICLES: ReadingArticle[] = [
  {
    id: 1,
    hskLevel: 1,
    title: "Who I am",
    chineseTitle: "我是谁",
    content: "我的名字叫李大卫， 我是美国人， 但是在日本长大， 在英国上大学， 现在在中国工作。 我在大学学习历史和英语， 现在是一个英语老师， 我非常喜欢我的工作。 学生们很好， 学校也很好。"
  },
  {
    id: 2,
    hskLevel: 1,
    title: "Do you know them?",
    chineseTitle: "你认识他们吗？",
    content: "你认识这两个人吗？她是我的中文老师，姓王；他是我弟弟的英文老师，姓李。王老师很漂亮，她今年二十八岁，喜欢旅游和跑步。李老师很高，今年三十二岁，在大学工作。他们两个人认识五年了，有一个女儿和一个儿子。女儿一岁，儿子三岁，他们会说中文，也会说英文。王老师和李老师都是很好的人，我和弟弟都很喜欢他们。"
  },
  {
    id: 3,
    hskLevel: 1,
    title: "My family",
    chineseTitle: "我的家人",
    content: "A：王老师，好久不见！\nB：好久不见！你也来这家饭店吃饭？\nA：对，我和我的家人来吃饭。我的朋友说这里的广东菜很好吃。\nB：你的爸爸妈妈也来了吗？\nA：没有，他们喜欢在家吃。我的孩子们来了。那是我的老公，小孙；那个是我的大儿子，小宝，今年7岁了；这是我的小女儿，小贝，今年5岁了。\nB：你们一家四口人真幸福！孩子们都上学了吗？\nA：大儿子去年上小学了，小女儿明年上小学。\nB：你老公也会说汉语吗？\nA：哈哈，当然，他是中国人！"
  },
  {
    id: 4,
    hskLevel: 1,
    title: "What to do tomorrow?",
    chineseTitle: "明天做什么？",
    content: "A：明天你想做什么？\nB：明天去学校。\nA：明天星期六，休息。\nB：是呢，我忘了。明天上午我想在家睡觉，下午我想去书店买书，你呢？\nA：我想去买东西。\nB：你想买什么？\nA：我想买一个杯子，一盒牛奶，还有一些水果。\nB：你喜欢吃什么水果？\nA：我喜欢吃香蕉和苹果。\nB：我家也没有水果了。现在的苹果很好，你帮我也买一斤吧。\nA：没问题。我明天几点给你苹果？\nB：明天我五点从书店回家，你五点来我家吧。你也可以在我家吃饭，明天我们自己做，怎么样？\nA：好，明天五点我去你家。"
  },
  {
    id: 5,
    hskLevel: 1,
    title: "Shopping",
    chineseTitle: "买东西",
    content: "A：先生，你想买什么？\nB：我很渴，有喝的东西吗？\nA：有。我们有水、茶、牛奶、咖啡、啤酒，你想喝什么？\nB：我要一瓶啤酒。\nA：好的，还要什么吗？\nB：我也买些吃的东西吧。\nA：没问题。我们有米饭、面条，也有面包，你想要哪个？\nB：一个面包。一共多少钱？\nA：啤酒三块五，面包十块，一共十三块五。\nB：好的，给你钱。\nA：这是你买的东西，再见。\nB：再见。"
  }
];
